"""
Напишите программу, которая принимает на вход цифру,
обозначающую день недели, и проверяет,
является ли этот день выходным.
"""
day = int(input("Enter the day number:"))

def checkDay(day):
    pass
if 0 < day <= 6:
    print("yes")
else:
    print("no")

checkDay(day)

